StoveOpt/tests/test_results/case_5277777778/0/details
Velocity
52.77777778